---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.BadViewForAttachedGroup
source: html/99f5ab1a-fe86-429c-8485-50c995f82591.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.BadViewForAttachedGroup Property

Attached groups can only be created for view specific elements belonging to non-3d model views.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadViewForAttachedGroup { get; }
```